In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
list_data = [1, 2, 3, 4, 5]
list_name = ["a", "b" ,"c" ,"d" ,"e"]

example_obj = Series(data=list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
example_obj.name = "number"
example_obj.index.name = "id"
example_obj

id
a    1
b    2
c    3
d    4
e    5
Name: number, dtype: int64

In [5]:
dict_data = { "a": 1, "b": 2, "c": 3, "d": 4, "e": 5 }
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [6]:
raw_data = {
      'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
      'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
      'age': [42, 52, 36, 24, 73],
      'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']
    }

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [7]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [8]:
df[["first_name"]]

  first_name
0      Jason
1      Molly
2       Tina
3       Jake
4        Amy

In [9]:
df.drop(1).head()

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [10]:
df.drop(1).head()

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [11]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [12]:
df.drop(1, inplace=True)

In [13]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [14]:
ipl_data = {
      'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
      'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
      'Year': [2014, 2015, 2014, 2014, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
      'Points':[876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]
    }

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2014     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [16]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [17]:
df.groupby("Year")["Points"].sum()

Year
2014    3854
2015    2405
2016    1450
2017    1478
Name: Points, dtype: int64

In [18]:
df.groupby(["Team", "Year"])["Points"].sum()

Team    Year
Devils  2014    1536
Kings   2014     741
        2016     756
        2017     788
Riders  2014     876
        2015     789
        2016     694
        2017     690
Royals  2014     701
        2015     804
kings   2015     812
Name: Points, dtype: int64

In [19]:
df.groupby("Team").filter(
    lambda x: len(x) >= 3
)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [20]:
raw_data = {
      'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
      'test_score': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
    }

df_left = pd.DataFrame(raw_data, columns=['subject_id', 'test_score'])
df_left

  subject_id  test_score
0          1          51
1          2          15
2          3          15
3          4          61
4          5          16
5          7          14
6          8          15
7          9           1
8         10          61
9         11          16

In [21]:
raw_data = {
      'subject_id': ['4', '5', '6', '7', '8'],
      'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
      'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
    }

df_right = pd.DataFrame(raw_data, columns=['subject_id', 'first_name', 'last_name'])
df_right

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [22]:
pd.merge(left=df_left, right=df_right, how="inner", on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [23]:
pd.merge(left=df_left, right=df_right, how="left", on='subject_id')

  subject_id  test_score first_name last_name
0          1          51        NaN       NaN
1          2          15        NaN       NaN
2          3          15        NaN       NaN
3          4          61      Billy    Bonder
4          5          16      Brian     Black
5          7          14      Bryce     Brice
6          8          15      Betty    Btisan
7          9           1        NaN       NaN
8         10          61        NaN       NaN
9         11          16        NaN       NaN

In [24]:
pd.merge(left=df_left, right=df_right, how="right", on='subject_id')

  subject_id  test_score first_name last_name
0          4        61.0      Billy    Bonder
1          5        16.0      Brian     Black
2          6         NaN       Bran   Balwner
3          7        14.0      Bryce     Brice
4          8        15.0      Betty    Btisan

In [25]:
pd.merge(left=df_left, right=df_right, how="outer", on='subject_id')

   subject_id  test_score first_name last_name
0           1        51.0        NaN       NaN
1           2        15.0        NaN       NaN
2           3        15.0        NaN       NaN
3           4        61.0      Billy    Bonder
4           5        16.0      Brian     Black
5           7        14.0      Bryce     Brice
6           8        15.0      Betty    Btisan
7           9         1.0        NaN       NaN
8          10        61.0        NaN       NaN
9          11        16.0        NaN       NaN
10          6         NaN       Bran   Balwner